[
  {
    "slug": "benefits-of-assisted-living",
    "title": "What are the benefits of assisted living?",
    "author": "Dawn Bare",
    "date": "June 29, 2021",
    "content": "<p>For many years, people have equated assisted living communities with nursing homes.</p><p>However, in reality, assisted living communities are vastly different from skilled nursing facilities.</p><p>Assisted living communities are ever changing. They evolve to meet the needs of the newest generation entering their care. Many assisted living communities offer a range of care services that allow residents to live independently while still receiving the proper care that they need. They provide a vibrant living environment that allows seniors in various stages of life to live happy and carefree.</p><p><b>REDUCTION IN SOCIAL ISOLATION</b></p><p>Many seniors experience social isolation when living alone at home. Many things can contribute to this isolation including: the passing of a spouse and close friends, the proximity of their children, and their ability to drive and move around. Although, social isolation is detrimental to everyone, it is especially concerning for seniors. In fact, the CDC considers loneliness and isolation to be a serious health risk to seniors.</p><p>Assisted living communities can provide a solution to your loved one's social isolation. Not only can you choose a community located closer to family and friends, but also your loved one is going to be living mere steps away from potential new friends. In addition, assisted living communities provide daily activities and communal meals where your loved can get out of their room and enjoy their day in the company of others.</p><p>The communities aim to provide a variety of activities to meet every resident need including: games, fitness, happy hour, crafts, art, outing and entertainment.</p><p><b>WELLNESS PROGRAMS</b></p><p>As we get older, it can become more difficult to find physical activities that are geared towards your bodies needs. Fortunately, assisted living communities are constantly developing wellness programs that target the physical, mental, and spiritual needs of today's seniors.</p><p>Your loved one could be taking a yoga class in the morning, learning about nutrition through a workshop with a trained professional before lunch, playing brain games in the afternoon, and meditating before dinner.</p><p>They get the benefit of all these great resources without feeling intimidated or nervous, because all the other people around them are their same age.</p><p><b>MORE FREE TIME</b></p><p>The day-to-day activities of tending to a home can become challenging and troublesome to a senior.</p><p>Assisted living communities offer a solution. They often provide three meals a day, snacks, laundry services, and weekly housekeeping in their monthly rent price. Some communities even include more upscale features like room service. The goal being to provide their residents with an increased quality of life and give them the opportunity to enjoy their later years hanging out with their friends and engaging in enjoyable activities.</p><p><b>PEACE OF MIND</b></p><p>Unfortunately, for many families, the conversation about senior living starts when there is an accident or notable behavior change with a loved one. Between the mental declines that seniors can experience with social isolation and the physical declines seen with aging, the idea of a loved one living alone can create a lot of stress. Often, even when a senior moves in with a family member, there is still stress involved with acting as a caregiver for your loved one.</p><p>However, when you place your loved one in an assisted living community, there is peace of mind in knowing that they are always going to have someone available to meet their care needs. Your loved one will have daily check ins from staff members, activities to participate in, balanced meals, and trained caregivers to help them with daily activities.</p><p>So, although many find it difficult to place their family member in an assisted living at first, they often feel relieved after seeing their loved one thrive in their new home.</p>"
  },
  {
    "slug": "four-helpful-tips-to-reduce-fall-risks-for-seniors",
    "title": "Four Helpful Tips to Reduce Fall Risks for Seniors",
    "author": "Victoria Zeccola",
    "date": "July 12, 2021",
    "content": "<p>For those of us under the age of 65, it usually leads to a bruise, scrape or bump that will heal faster than our egos. However, as we age, the risks associated with falls drastically increases. For older people, a fall could result in breaks, expensive medical bills, and more serious health conditions.</p><p>Not only are falls more serious for seniors, but they are also more prevalent. According to the National Institute on Aging, one in three adults over the age of 65 fall each year. So, if you are an older person, the important question is 'how do you decrease your risk of falling'. Fortunately, there are some easy steps that you and your loved ones can take to reduce your chances of falling.</p><p><b>1. Stay Active</b></p><p>Muscle weakness, gait, and balance are all factors that can increase your risk of falling. Although, it may seem safer to stay home and reduce your physical activity, moving your body every day is an important to keep up your strength and stability. Low impact exercises, walks around your neighborhood, lunch with a friend, and your weekly errands are great ways to keep your body and mind active!</p><p><b>2. Keep up with your doctor's visits and medications</b></p><p>Your muscles are not the only part of your body that contribute to your risk of falling. It is important to stay on top of your appointments, including getting your eyesight and hearing checked. Visual and auditory impairments can contribute to your risk of falling. When you are at your doctor appointments, make sure that you have a good understanding of the potential side effects of any medications you are on so you can access if they may decrease your balance and stability. Also, make sure that you are checking in with you doctor if you have diabetes or blood pressure issues. If not properly managed, these conditions could increase your chances of a fall.</p><p><b>3. Maintain a Healthy Lifestyle</b></p><p>A good night's sleep and a well-balanced diet are important no matter your age. However, sleep and a proper diet can help you stay alert as you go about your day. For that same reason, limiting your alcohol intake can also help you keep focus and be aware of your surroundings.</p><p><b>4. Be Aware and Modify Your Environment</b></p><p>Keeping our bodies healthy is only one part of the equation when it comes to a fall. Another key element that increases the risks of falls for seniors is your environment. Set yourself up for success by evaluating and modifying areas in your home to decrease the amount of tripping hazards.</p><p>Things you can modify:</p><p><b>Cords</b> - Make sure they secured to the floor and out of your walking path.</p><p><b>Rugs</b> - Rug tape and mats can help keeps them from bunching up and become a hazard.</p><p><b>Pets</b> - Pets love to be under your feet! Consider putting a bell on their collar so you hear them even when you don't see them.</p><p><b>Furniture</b> - Give yourself room to walk. Moving furniture with sharp or protruding edges can help keep you from bumping into them. You may also want to consider downsizing, if it takes up too much space.</p><p><b>Clutter</b> - Keep things off the floor!</p><p>There is only so much that you can control in your environment so always make sure to be aware of your surroundings. This world is so focused on speed and efficiency that you can get swept up in the moment and not see a potential hazard before it's too late. Take your time and let other people wait on you!</p>"
  },
  {
    "slug": "six-options-for-financing-senior-living",
    "title": "Six Options for Financing the Cost of Senior Living",
    "author": "Victoria Zeccola",
    "date": "July 26, 2021",
    "content": "<p>Most people don't think about senior living until they have to. Whether it is prompted by a loved one suddenly in need of care or a senior deciding that it is a time to downsize, choosing the right senior living may be the biggest choice you were never prepared to make.</p><p>On top of that, paying for senior living is not cut and dry. There is a steep learning curve to overcome.</p><p>So, with that in mind, let's review some options that you or a loved one may have when deciding how to finance the cost of senior living.</p><p><b>1. Long Term Care Insurance</b></p><p>If a loved one is in need of care from an assisted living or nursing home, long term care insurance can be a great way to help cover the cost. Long Term Care Insurance helps cover care that normal insurance providers don't tend to cover like: bathing, dressing, or assistance with getting in and out of bed. It also helps cover chronic conditions like disabilities or diseases like Alzheimer's. If your loved one has long term care insurance, make sure to inquire about the policy and the care that will be covered under it.</p><p><b>2. Life Insurance Policy</b></p><p>Leveraging a life insurance policy is another way that you or a loved one can help pay for the cost of senior living.</p><p>There are three options when leveraging a life insurance policy:</p><p><i>a. Borrow from the Policy<br/>b. Withdraw your cost basis (what you in premiums)<br/>c. Cash in the policy</i></p><p>If you choose two use the first two options, you will not owe taxes on the withdrawn money. However, if you choose to cash out the policy, you will owe taxes.</p><p><b>3. Home Loan</b></p><p>If you or your loved one do not intend on selling your house right away, a home loan may be a good option to help cover the cost of senior living. Many banks will offer seniors bridge loans or home equity loans.</p><p>It may be good to sit down with a financial advisor when considering a home loan to try to find a loan option with lower upfront cost.</p><p><b>4. Medicare</b></p><p>Medicare will not help cover the cost of independent living or assisted living. Medicare will only help cover some of the costs associated with a stay at a skilled nursing facility.</p><p><b>5. Medicaid</b></p><p>For seniors with lower socioeconomic statuses and little equity, Medicaid may be an option to help pay for a senior living community. However, the ability to use this benefit will vary by state and depend on whether the community accepts Medicaid payments. It is also worth noting that communities that accept Medicaid are often full so you may be put on a waitlist.</p><p><b>6. Veteran's Affairs (VA) Benefits</b></p><p>Veterans' and their spouses may be eligible for assistance under the Aid & Assistance benefit. The program offers veterans' and/or spouses with up to $2,120 per month to help pay for the cost of care.</p><p>Check out <a href=\"https://www.va.gov/pension/aid-attendance-housebound/\">https://www.va.gov/pension/aid-attendance-housebound/</a> to review the eligibility requirements.</p>"
  }
]
